Revit 2026 API

# AreaLoadAreCurveLoopsValid Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool AreCurveLoopsValid(
	IList<CurveLoop> loops
)
```
```vb
Public Shared Function AreCurveLoopsValid (
	loops As IList(Of CurveLoop)
) As Boolean
```
```cpp
public:
static bool AreCurveLoopsValid(
	IList<CurveLoop^>^ loops
)
```
```fsharp
static member AreCurveLoopsValid :
        loops : IList<CurveLoop> -> bool
```

#### Parameters

loops IListCurveLoop

#### Return Value

Boolean

#### Reference

AreaLoad Class

Autodesk.Revit.DB.Structure Namespace